// I AM NOT DONE

mod retirement;

fn main() {
    // let res = retirement::retire_time("1971-04", "原法定退休年龄55周岁女职工");
    // println!("{res}");
    // 定义测试用例和预期结果
    const TEST_CASES: &[(&str, &str, &str)] = &[
        ("1971-04", "原法定退休年龄55周岁女职工", "2026-08,55.33,4"),
        ("1995-12", "原法定退休年龄50周岁女职工", "2050-12,55,60"),
        ("1995-12", "男职工", "2058-12,63,36"),
        ("2000-12", "原法定退休年龄55周岁女职工", "2058-12,58,36"),
        ("2000-12", "男职工", "2063-12,63,36"),
        ("1965-12", "男职工", "2026-03,60.25,3"),
        ("1963-12", "男职工", "2023-12,60,0"),
        ("1963-04", "原法定退休年龄55周岁女职工", "2018-04,55,0"),
        ("1964-02", "男职工", "2024-02,60,0"),
        ("1965-01", "男职工", "2025-02,60.08,1"),
    ];
    for (time, tp, expected) in TEST_CASES {
        let result = retirement::retire_time(*time, *tp);

        println!("{:?} {:?}",result,expected);
    }
}
